In [1]:
# Read the dataframe in the problem statement
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'], 
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [2]:
'''Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row 
so 10055 and 10075 need to be put in place. 
Fill in these missing numbers and make the column an integer column (instead of a float column)'''

# Increment the value of FlightNumber and fill the NaN values. Also change the values to Integers from Float. 
n=[]
for i,x in enumerate(df['FlightNumber']):
    n.append(int(10045+10*i))
df['FlightNumber']=n
print(df)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [3]:
'''The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give
a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame'''

# Use String Split using '_' to get two different columns for From and To
temp_df=df['From_To'].str.split('_',expand=True)
temp_df.rename(columns={0:'From',1:'To'},inplace=True)
print(temp_df)

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [4]:
'''Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. 
Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)'''

# Capitalize the String in the temporary dataframe. 

temp_df=temp_df.apply(lambda str1:str1.str.capitalize())
print(temp_df)

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [5]:
'''Delete the From_To column from df and attach the temporary DataFrame from the previous step.'''

# Delete the From_To column of the first dataframe 

df.drop(['From_To'],axis=1,inplace=True)
print('Dataframe after deleting the From_To column \n' , '*'*42)
print(df)

# Attach the temporary dataframe created for From and To 

df=pd.concat([df,temp_df],axis=1)
print('\n Dataframe after concatenating the temporary dataframe \n' , '*'*53)
print(df)

Dataframe after deleting the From_To column
 ******************************************
   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

 Dataframe after concatenating the temporary dataframe
 *****************************************************
   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [6]:
'''In the RecentDelays column, the values have been entered into the DataFrame as a list. 
We would like each first value in its own column, each second value in its own column, and so on. 
If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. 
and replace the unwanted RecentDelays column in df with delays.
'''

# Create delays dataframe with the delay from the RecentDelays List column from df dataframe. 
delays = df['RecentDelays'].apply(pd.Series)
delays.rename(columns = lambda x : 'delay_' + str(x+1), inplace=True)

print('delays Dataframe\n', '*'*14)
print(delays)

# Drop the RecentDelays column. 
df.drop(['RecentDelays'],axis=1,inplace=True)
print('\ndf Dataframe after dropping RecentDelays column \n' , '*'*45)
print(df)

# Add the Columns from delays dataframe to the initial dataframe

df=pd.concat([df,delays],axis=1)
print('\nFinal df Dataframe\n' , '*'*15)
df

delays Dataframe
 **************
   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

df Dataframe after dropping RecentDelays column
 *********************************************
   FlightNumber              Airline      From         To
0         10045               KLM(!)    London      Paris
1         10055    <Air France> (12)    Madrid      Milan
2         10065  (British Airways. )    London  Stockholm
3         10075       12. Air France  Budapest      Paris
4         10085          "Swiss Air"  Brussels     London

Final df Dataframe
 ***************

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN